// pages/shouye/shouye.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    swiperArr: [
      '../../image/1.jpg',
      '../../image/2.jpg',
      '../../image/3.jpg',
      '../../image/4.jpg',
      '../../image/5.jpg',
    ],
    imgArr: [
      '../../image/1.jpg',
      '../../image/2.jpg',
      '../../image/3.jpg',
      '../../image/4.jpg',
    ],
    textArr: [
      'iphone 7 plus',
      '大屏手机续航新标杆',
      '国庆7天如何防堵',
      '只需一挥手，抚光灯'
    ],
    lists: ['', '', '', ''],
    hotArr: ['美丽青年', '八问魅蓝', '屋中自有颜如玉', '爱上你'],
    hotContent: ['内容1**************************************************************************', '内容2**************************************************************************', '内容3**************************************************************************', '内容4**************************************************************************']
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})